Revit 2027 API
ExportFontTable.Item Property
 A copy of the ExportFontInfo for the font's ExportFontKey.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportFontInfo this[
	ExportFontKey fontKey
] { get; set; }
Public Default Property Item (
	fontKey As ExportFontKey
) As ExportFontInfo
	Get
	Set
public:
virtual property ExportFontInfo^ default[ExportFontKey^ fontKey] {
	ExportFontInfo^ get (ExportFontKey^ fontKey) sealed;
	void set (ExportFontKey^ fontKey, ExportFontInfo^ value) sealed;
}
abstract Item : ExportFontInfo with get, set
override Item : ExportFontInfo with get, set
Parameters
fontKey ExportFontKey
Return Value
ExportFontInfo
 A copy of the ExportFontInfo.
Exceptions
Exception | Condition
ArgumentException |  When getting this property: An entry with the given key is not present in the table.
Remarks
 When getting this property, it returns a copy of the ExportFontInfo from the table. In order to make changes to the ExportFontInfo and use those settings during export, set the modified ExportFontInfo back into the table using the same key.
See Also
Reference
ExportFontTable Class
Autodesk.Revit.DB Namespace